betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_comp.c
/**
  *
  * @file    apm32f4xx_dal_comp.c
  * @brief   COMP DAL module driver.
  *          This file provides firmware functions to manage the following
  *          functionalities of the COMP peripheral:
  *           + Initialization and de-initialization functions
  *           + Peripheral Control functions
  *           + Peripheral State functions
  *
  *
  * @attention
  *
  * Redistribution and use in source and binary forms, with or without modification, 
  * are permitted provided that the following conditions are met:
  *
  * 1. Redistributions of source code must retain the above copyright notice,
  *    this list of conditions and the following disclaimer.
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  * 3. Neither the name of the copyright holder nor the names of its contributors
  *    may be used to endorse or promote products derived from this software without
  *    specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
  * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
  * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
  * IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
  * INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
  * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
  * DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
  * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE
  * OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED
  * OF THE POSSIBILITY OF SUCH DAMAGE.
  * The original code has been modified by Geehy Semiconductor.
  * Copyright (c) 2017 STMicroelectronics. Copyright (C) 2023-2025 Geehy Semiconductor.
  * All rights reserved.
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  *
  @verbatim
 ===============================================================================
                     ##### COMP Peripheral features #####
 ===============================================================================

  [..]
    The APM32F411xx integrates 2 analog comparators COMP1 and COMP2:
    (#) The COMP input minus (inverting input) and input plus (non inverting input)
        can be set to internal references or to GPIO pins

    (#) The COMP output is available using DAL_COMP_GetOutputLevel().

    (#) The COMP output can be redirected to embedded timers (TMR1, TMR8, TMR2, TMR3, TMR4)

    (#) Paris of comparators instances can be combined in window mode.

    ##### How to use this driver #####
===============================================================================
[..]
    This driver provides functions to configure and program the Comparators of 
    APM32F411xx devices.

    To use the comparator, perform the following steps:

    (#) Initialize the COMP low level resources by implementing the DAL_COMP_MspInit():
        (##) Enable the COMP interface clock using __DAL_RCC_SYSCFG_CLK_ENABLE() function.
        (##) Configure the GPIO connected to comparator inputs plus and minus in analog mode
             using DAL_GPIO_Init().

    (#) Configuration the COMP peripheral using DAL_COMP_Init() function:
    (##) Select the window mode (Available only on COMP1 instance)
    (##) Select the speed mode (Available only on COMP2 instance)
    (##) Select the input minus (inverting input)
    (##) Select the input plus (non-inverting input)
    (##) Select the output polarity
    (##) Select the output redirection

    (#) Enable the comparator using DAL_COMP_Start() function

    (#) Use DAL_COMP_GetOutputLevel() function to get the output level (high or low).

    (#) Disable the comparator using DAL_COMP_Stop() function

    (#) De-initialize the comparator using DAL_COMP_DeInit() function.

    (#) For safety purpose, use DAL_COMP_Lock() function to lock the whole
        configuration of the comparator unit and the CSTS registers.
        Then, no further change of the comparator unit configuration can be done
        until the next reset.

    (#) Reset the comparator only by system reset.

    (#) If needed, reinitialize the comparator using DAL_COMP_Init() function.
    
    *** Callback registration ***
    =============================================
    [..]

    The compilation define  USE_DAL_COMP_REGISTER_CALLBACKS when set to 1,
    allows the user to configure dynamically the driver callbacks.
    Use Functions @ref DAL_COMP_RegisterCallback() to register an callback.
    [..]

    Function @ref DAL_COMP_RegisterCallback() allows to register following callbacks:
      (+) MspInitCallback    : COMP MspInit.
      (+) MspDeInitCallback  : COMP MspDeInit.
    This function takes as parameters the DAL peripheral handle, the Callback ID
    and a pointer to the user callback function.
    [..]

    Use function @ref DAL_COMP_UnRegisterCallback() to reset a callback to the default
    weak function.
    [..]

    @ref DAL_COMP_UnRegisterCallback() takes as parameters the DAL peripheral handle,
    and the Callback ID.
    This function allows to reset following callbacks:
      (+) MspInitCallback    : COMP MspInit.
      (+) MspDeInitCallback  : COMP MspDeInit.
    [..]

    By default, after the @ref DAL_COMP_Init() and if the state is DAL_COMP_STATE_RESET
    all callbacks are reset to the corresponding legacy weak functions.
    Exception done for MspInit and MspDeInit functions that are respectively
    reset to the legacy weak functions in the @ref DAL_COMP_Init() and @ref DAL_COMP_DeInit() only when
    these callbacks are null (not registered beforehand).
    [..]

    If MspInit or MspDeInit are not null, the @ref DAL_COMP_Init() and @ref DAL_COMP_DeInit()
    keep and use the user MspInit/MspDeInit callbacks (registered beforehand) whatever the state.
    [..]

