betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_comp.c
    Callbacks can be registered/unregistered in DAL_COMP_STATE_READY state only.
    Exception done MspInit/MspDeInit functions that can be registered/unregistered
    in DAL_COMP_STATE_READY or DAL_COMP_STATE_RESET state,
    thus registered (user) MspInit/DeInit callbacks can be used during the Init/DeInit.
    [..]

    Then, the user first registers the MspInit/MspDeInit user callbacks
    using @ref DAL_COMP_RegisterCallback() before calling @ref DAL_COMP_DeInit()
    or @ref DAL_COMP_Init() function.
    [..]

    When the compilation define USE_DAL_COMP_REGISTER_CALLBACKS is set to 0 or
    not defined, the callback registration feature is not available and all callbacks
    are set to the corresponding legacy weak functions.

  @endverbatim
  ******************************************************************************

  Table 1. COMP inputs for APM32F411xx devices
    +---------------------------------------------------------+
    |                |                |   COMP1   |   COMP2   |
    |----------------|----------------|-----------|-----------|
    |                |                |   PC0     |   PC2     |
    | Input Plus     |  GPIO          |   PC2     |   PC2     |
    |                |                |           |           |
    |----------------|----------------|-----------|-----------|
    |                | VREFINT        | Available | Available |
    |                | PC1            | Available |           |
    |                | PC3            |           | Available |
    | Input Minus    | 1/4 VREFINT    |           | Available |
    |                | 1/2 VREFINT    |           | Available |
    |                | 3/4 VREFINT    |           | Available |
    |                |                |           |           |
    +---------------------------------------------------------+
    |                | TMR1 BK IN     | Available | Available |
    |                | TMR1 IC1       | Available | Available |
    |                | TMR1 ETRF      | Available | Available |
    |                | TMR8 BK IN     | Available | Available |
    |                | TMR8 IC1       | Available | Available |
    | Output         | TMR8 ETRF      | Available | Available |
    |                | TMR2 IC4       | Available | Available |
    |                | TMR2 ETRF      | Available | Available |
    |                | TMR3 IC1       | Available | Available |
    |                | TMR3 ETRF      | Available | Available |
    |                | TMR4 IC1       | Available | Available |
    |                |                |           |           |
    +---------------------------------------------------------+

    ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "apm32f4xx_dal.h"

/** @addtogroup APM32F4xx_DAL_Driver
  * @{
  */

/** @defgroup COMP COMP
 * @brief COMP DAL driver modules
 * @{
 */

#ifdef DAL_COMP_MODULE_ENABLED

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/** @defgroup COMP_Private_Constants COMP Private Constants
  * @{
  */

/* Delay for COMP startup time.                                         */
#define COMP_DELAY_STARTUP_US               (80UL)      /*!< Delay for COMP startup time. */

/**
 * @}
 */

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/* Exported functions --------------------------------------------------------*/

/** @defgroup COMP_Exported_Functions COMP Exported Functions
  * @{
  */

/** @defgroup COMP_Exported_Functions_Group1 Initialization and de-initialization functions
 * @brief    Initialization and Configuration functions
 *
 * @verbatim
 * ===============================================================================
 *             ##### Initialization and Configuration functions #####
 * ===============================================================================
 *   [..] This section provides functions allowing to:
 *     (+) Initialize and configure the COMP.
 *     (+) De-initialize the COMP.
 *
 * @endverbatim
  * @{
  */

/**
 * @brief  Initialize the COMP according to the specified parameters
 *         in the COMP_InitTypeDef and initialize the associated handle.
 * @note   If the selected comparator is locked, initialization cannot be performed.
 *         To unlock the configuration, perform a system reset.
 * @param  hcomp COMP handle
 * @retval DAL status
 */
DAL_StatusTypeDef DAL_COMP_Init(COMP_HandleTypeDef *hcomp)
{
    DAL_StatusTypeDef status = DAL_OK;
    uint32_t temp;

    /* Check the COMP handle allocation */
    if (hcomp == NULL)
    {
        status = DAL_ERROR;
    }
    else if (__DAL_COMP_IS_LOCKED(hcomp))
    {
        status = DAL_ERROR;
    }
    else
    {
        /* Check the parameters */
        ASSERT_PARAM(IS_COMP_ALL_INSTANCE(hcomp->Instance));
        if (hcomp->Instance == COMP1)
        {
            ASSERT_PARAM(IS_COMP_WINDOWMODE(hcomp->Init.WindowMode));
            ASSERT_PARAM(IS_COMP1_INVERTINGINPUT(hcomp->Init.InvertingInput));
        }
        else
        {
            ASSERT_PARAM(IS_COMP_SPEEDMODE(hcomp->Init.Mode));
            ASSERT_PARAM(IS_COMP2_INVERTINGINPUT(hcomp->Init.InvertingInput));
            ASSERT_PARAM(IS_COMP_NONINVERTINGINPUT(hcomp->Init.NonInvertingInput));
        }
        ASSERT_PARAM(IS_COMP_OUTPUT(hcomp->Init.Output));
        ASSERT_PARAM(IS_COMP_OUTPUTPOL(hcomp->Init.OutputPol));

        if (hcomp->State == DAL_COMP_STATE_RESET)
        {
            /* Allocate lock resource and initialize it */
            hcomp->Lock = DAL_UNLOCKED;

            /* Set COMP error code to none */
            COMP_CLEAR_ERRORCODE(hcomp);

#if (USE_DAL_COMP_REGISTER_CALLBACKS == 1)
            /* Init the COMP Callback settings */
            if (hcomp->MspInitCallback == NULL)
            {
                hcomp->MspInitCallback = DAL_COMP_MspInit; /* Legacy weak MspInit */
            }

            /* Init the low level hardware */
            hcomp->MspInitCallback(hcomp);
#else
            /* Init the low level hardware */
            DAL_COMP_MspInit(hcomp);
#endif /* USE_DAL_COMP_REGISTER_CALLBACKS */
        }

        /* Set COMP1 parameters */
        if (hcomp->Instance == COMP1)
        {
            temp = (hcomp->Init.WindowMode | \
                    hcomp->Init.InvertingInput | \
                    hcomp->Init.OutputPol | \
                    hcomp->Init.Output);

            /* Set parameters in COMP_CSTS register */
            MODIFY_REG(hcomp->Instance->CSTS,
                       COMP_CSTS_WMODESEL | COMP_CSTS_INMCCFG | COMP_CSTS_POLCFG | COMP_CSTS_OUTSEL,
                       temp);
        }
        /* Set COMP2 parameters */
        else
        {
            temp = (hcomp->Init.Mode | \
                    hcomp->Init.InvertingInput | \
                    hcomp->Init.NonInvertingInput | \
                    hcomp->Init.OutputPol | \
                    hcomp->Init.Output);

            /* Set parameters in COMP_CSTS register */
            MODIFY_REG(hcomp->Instance->CSTS,
                       COMP_CSTS_SPEEDM | COMP_CSTS_INMCCFG | COMP_CSTS_INPCCFG | COMP_CSTS_POLCFG | COMP_CSTS_OUTSEL,
                       temp);
        }

        /* Set DAL COMP handle state */
        if (hcomp->State == DAL_COMP_STATE_RESET)
        {
            hcomp->State = DAL_COMP_STATE_READY;
        }
    }

