betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_comp.c
    return status;
}

/**
 * @brief  DeInitialize the COMP peripheral.
 * @param  hcomp COMP handle
 * @retval DAL status
 */
DAL_StatusTypeDef DAL_COMP_DeInit(COMP_HandleTypeDef *hcomp)
{
    DAL_StatusTypeDef status = DAL_OK;

    /* Check the COMP handle allocation */
    if (hcomp == NULL)
    {
        status = DAL_ERROR;
    }
    else if (__DAL_COMP_IS_LOCKED(hcomp))
    {
        status = DAL_ERROR;
    }
    else
    {
        /* Check the parameters */
        ASSERT_PARAM(IS_COMP_ALL_INSTANCE(hcomp->Instance));

        /* Set COMP_CSTS register to reset value */
        WRITE_REG(hcomp->Instance->CSTS, 0x00000000UL);

#if (USE_DAL_COMP_REGISTER_CALLBACKS == 1)
        if (hcomp->MspDeInitCallback == NULL)
        {
            hcomp->MspDeInitCallback = DAL_COMP_MspDeInit; /* Legacy weak MspDeInit */
        }

        /* DeInit the low level hardware */
        hcomp->MspDeInitCallback(hcomp);
#else
        /* DeInit the low level hardware */
        DAL_COMP_MspDeInit(hcomp);
#endif /* USE_DAL_COMP_REGISTER_CALLBACKS */

        /* Set DAL COMP handle state */
        hcomp->State = DAL_COMP_STATE_RESET;

        /* Release Lock */
        __DAL_UNLOCK(hcomp);
    }

    return status;
}

/**
 * @brief  Initialize the COMP MSP.
 * @param  hcomp COMP handle
 * @retval None
 */
__WEAK void DAL_COMP_MspInit(COMP_HandleTypeDef *hcomp)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hcomp);

    /* NOTE : This function should not be modified, when the callback is needed,
              the DAL_COMP_MspInit could be implemented in the user file
     */
}

/**
 * @brief  DeInitialize COMP MSP.
 * @param  hcomp COMP handle
 * @retval None
 */
__WEAK void DAL_COMP_MspDeInit(COMP_HandleTypeDef *hcomp)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hcomp);

    /* NOTE : This function should not be modified, when the callback is needed,
              the DAL_COMP_MspDeInit could be implemented in the user file
     */
}

#if (USE_DAL_COMP_REGISTER_CALLBACKS == 1)
/**
 * @brief  Register a User COMP Callback
 *         To be used instead of the weak predefined callback
 * @param  hcomp COMP handle
 * @param  CallbackID ID of the callback to be registered
 *         This parameter can be one of the following values:
 *           @arg @ref DAL_COMP_MSPINIT_CB_ID COMP MspInit callback ID
 *           @arg @ref DAL_COMP_MSPDEINIT_CB_ID COMP MspDeInit callback ID
 * @param  pCallback pointer to the Callback function
 * @retval DAL status
 */
DAL_StatusTypeDef DAL_COMP_RegisterCallback(COMP_HandleTypeDef *hcomp, DAL_COMP_CallbackIDTypeDef CallbackID, pCOMP_CallbackTypeDef pCallback)
{
    DAL_StatusTypeDef status = DAL_OK;

    if (pCallback == NULL)
    {
        /* Update the error code */
        hcomp->ErrorCode |= DAL_COMP_ERROR_INVALID_CALLBACK;

        return DAL_ERROR;
    }

    if (DAL_COMP_STATE_READY == hcomp->State)
    {
        switch (CallbackID)
        {
            case DAL_COMP_MSPINIT_CB_ID:
                hcomp->MspInitCallback = pCallback;
                break;

            case DAL_COMP_MSPDEINIT_CB_ID:
                hcomp->MspDeInitCallback = pCallback;
                break;

            default:
                /* Update the error code */
                hcomp->ErrorCode |= DAL_COMP_ERROR_INVALID_CALLBACK;

                /* Return error status */
                status = DAL_ERROR;
                break;
        }
    }
    else if (DAL_COMP_STATE_RESET == hcomp->State)
    {
        switch (CallbackID)
        {
            case DAL_COMP_MSPINIT_CB_ID:
                hcomp->MspInitCallback = pCallback;
                break;

            case DAL_COMP_MSPDEINIT_CB_ID:
                hcomp->MspDeInitCallback = pCallback;
                break;

            default:
                /* Update the error code */
                hcomp->ErrorCode |= DAL_COMP_ERROR_INVALID_CALLBACK;

                /* Return error status */
                status = DAL_ERROR;
                break;
        }
    }
    else
    {
        /* Update the error code */
        hcomp->ErrorCode |= DAL_COMP_ERROR_INVALID_CALLBACK;

        /* Return error status */
        status = DAL_ERROR;
    }

    return status;
}

/**
 * @brief  Unregister an COMP Callback
 *         COMP callback is redirected to the weak predefined callback
 * @param  hcomp COMP handle
 * @param  CallbackID ID of the callback to be unregistered
 *         This parameter can be one of the following values:
 *           @arg @ref DAL_COMP_MSPINIT_CB_ID COMP MspInit callback ID
 *           @arg @ref DAL_COMP_MSPDEINIT_CB_ID COMP MspDeInit callback ID
 * @retval DAL status
 */
DAL_StatusTypeDef DAL_COMP_UnRegisterCallback(COMP_HandleTypeDef *hcomp, DAL_COMP_CallbackIDTypeDef CallbackID)
{
    DAL_StatusTypeDef status = DAL_OK;

    if (DAL_COMP_STATE_READY == hcomp->State)
    {
        switch (CallbackID)
        {
            case DAL_COMP_MSPINIT_CB_ID:
                hcomp->MspInitCallback = DAL_COMP_MspInit; /* Legacy weak MspInit */
                break;

            case DAL_COMP_MSPDEINIT_CB_ID:
                hcomp->MspDeInitCallback = DAL_COMP_MspDeInit; /* Legacy weak MspDeInit */
                break;

            default:
                /* Update the error code */
                hcomp->ErrorCode |= DAL_COMP_ERROR_INVALID_CALLBACK;

                /* Return error status */
                status = DAL_ERROR;
                break;
        }
    }
    else if (DAL_COMP_STATE_RESET == hcomp->State)
    {
        switch (CallbackID)
        {
            case DAL_COMP_MSPINIT_CB_ID:
                hcomp->MspInitCallback = DAL_COMP_MspInit; /* Legacy weak MspInit */
                break;

            case DAL_COMP_MSPDEINIT_CB_ID:
                hcomp->MspDeInitCallback = DAL_COMP_MspDeInit; /* Legacy weak MspDeInit */
                break;

            default:
                /* Update the error code */
                hcomp->ErrorCode |= DAL_COMP_ERROR_INVALID_CALLBACK;

                /* Return error status */
                status = DAL_ERROR;
                break;
        }
    }
    else
    {
        /* Update the error code */
        hcomp->ErrorCode |= DAL_COMP_ERROR_INVALID_CALLBACK;

        /* Return error status */
        status = DAL_ERROR;
    }

