betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_comp.c
    return status;
}

#endif /* USE_DAL_COMP_REGISTER_CALLBACKS */
/**
 * @}
 */

/** @defgroup COMP_Exported_Functions_Group2 Start-Stop operation functions
 * @brief Start-Stop operation functions.
 *
 * @verbatim
 * ===============================================================================
 *                  ##### IO operation functions #####
 * ===============================================================================
 *  [..] This section provides functions allowing to:
 *     (+) Start the comparator.
 *     (+) Stop the comparator.
 * 
 * @endverbatim
  * @{
  */

/**
 * @brief  Start the comparator.
 * @param  hcomp COMP handle
 * @retval DAL status
 */
DAL_StatusTypeDef DAL_COMP_Start(COMP_HandleTypeDef *hcomp)
{
    DAL_StatusTypeDef status = DAL_OK;
    uint32_t time_delay = 0UL;

    /* Check the COMP handle allocation */
    if (hcomp == NULL)
    {
        status = DAL_ERROR;
    }
    else if (__DAL_COMP_IS_LOCKED(hcomp))
    {
        status = DAL_ERROR;
    }
    else
    {
        /* Check the parameters */
        ASSERT_PARAM(IS_COMP_ALL_INSTANCE(hcomp->Instance));

        if (hcomp->State == DAL_COMP_STATE_READY)
        {
            /* Enable the selected comparator */
            SET_BIT(hcomp->Instance->CSTS, COMP_CSTS_EN);

            /* Set COMP state */
            hcomp->State = DAL_COMP_STATE_BUSY;

            /* Delay for COMP startup time */
            time_delay = ((COMP_DELAY_STARTUP_US / 10UL) * ((SystemCoreClock / (1000000UL * 2UL)) + 1UL));
            while (time_delay != 0UL)
            {
                time_delay--;
            }
        }
        else
        {
            status = DAL_ERROR;
        }
    }

    return status;
}

/**
 * @brief  Stop the comparator.
 * @param  hcomp COMP handle
 * @retval DAL status
 */
DAL_StatusTypeDef DAL_COMP_Stop(COMP_HandleTypeDef *hcomp)
{
    DAL_StatusTypeDef status = DAL_OK;

    /* Check the COMP handle allocation */
    if (hcomp == NULL)
    {
        status = DAL_ERROR;
    }
    else if (__DAL_COMP_IS_LOCKED(hcomp))
    {
        status = DAL_ERROR;
    }
    else
    {
        /* Check the parameters */
        ASSERT_PARAM(IS_COMP_ALL_INSTANCE(hcomp->Instance));

        if (hcomp->State == DAL_COMP_STATE_RESET)
        {
            /* Disable the selected comparator */
            CLEAR_BIT(hcomp->Instance->CSTS, COMP_CSTS_EN);

            /* Set COMP state */
            hcomp->State = DAL_COMP_STATE_READY;
        }
        else
        {
            status = DAL_ERROR;
        }
    }

    return status;
}

/**
 * @}
 */

/** @defgroup COMP_Exported_Functions_Group3 Peripheral Control functions
 * @brief    Peripheral Control functions
 * 
 * @verbatim
 * ===============================================================================
 *                ##### Peripheral Control functions #####
 * ===============================================================================
 * [..] This section provides functions allowing to:
 *     (+) Lock the selected comparator configuration.
 * 
 * @endverbatim
  * @{
  */

/**
 * @brief  Lock the selected comparator configuration.
 * @note   A system reset is required to unlock the comparator configuration.
 * @param  hcomp COMP handle
 * @retval DAL status
 */
DAL_StatusTypeDef DAL_COMP_Lock(COMP_HandleTypeDef *hcomp)
{
    DAL_StatusTypeDef status = DAL_OK;

    /* Check the COMP handle allocation */
    if (hcomp == NULL)
    {
        status = DAL_ERROR;
    }
    else if (__DAL_COMP_IS_LOCKED(hcomp))
    {
        status = DAL_ERROR;
    }
    else
    {
        /* Check the parameters */
        ASSERT_PARAM(IS_COMP_ALL_INSTANCE(hcomp->Instance));

        /* Set lock flag on state */
        switch(hcomp->State)
        {
            case DAL_COMP_STATE_READY:
                hcomp->State = DAL_COMP_STATE_READY_LOCKED;
                break;

            case DAL_COMP_STATE_RESET:
                hcomp->State = DAL_COMP_STATE_RESET_LOCKED;
                break;

            default:
                hcomp->State = DAL_COMP_STATE_BUSY_LOCKED;
                break;
        }
    }

    if (status == DAL_OK)
    {
        /* Set lock flag on handle */
        __DAL_COMP_LOCK(hcomp);
    }

    return status;
}

/**
 * @brief Return the output level (high or low) of the selected comparator.
 * @param  hcomp COMP handle
 * @retval Returns the selected comparator output level: 
 * @note  The output level depends on the selected polarity.
 *        If the polarity is not inverted:
 *        - Comparator output is low when the non-inverting input is at a lower
 *          voltage than the inverting input
 *        - Comparator output is high when the non-inverting input is at a higher
 *          voltage than the inverting input
 *       If the polarity is inverted:
 *        - Comparator output is high when the non-inverting input is at a lower
 *          voltage than the inverting input
 *        - Comparator output is low when the non-inverting input is at a higher
 *          voltage than the inverting input
 */
uint32_t DAL_COMP_GetOutputLevel(COMP_HandleTypeDef *hcomp)
{
    /* Check the parameters */
    ASSERT_PARAM(IS_COMP_ALL_INSTANCE(hcomp->Instance));

    /* Return the selected comparator output level */
    return (uint32_t)(READ_BIT(hcomp->Instance->CSTS, COMP_CSTS_OUTVAL));
}

/**
 * @}
 */

/** @defgroup COMP_Exported_Functions_Group4 Peripheral State functions
 * @brief    Peripheral State functions
 * 
 * @verbatim
 * ===============================================================================
 *                ##### Peripheral State functions #####
 * ===============================================================================
 * [..] This section provides functions allowing to:
 * 
 * @endverbatim
  * @{
  */

/**
 * @brief  Return the COMP state.
 * @param  hcomp COMP handle
 * @retval DAL state
 */
DAL_COMP_StateTypeDef DAL_COMP_GetState(COMP_HandleTypeDef *hcomp)
{
   /* Check the COMP handle allocation */
    if (hcomp == NULL)
    {
        return DAL_COMP_STATE_RESET;
    }

    /* Check the parameter */
    ASSERT_PARAM(IS_COMP_ALL_INSTANCE(hcomp->Instance));

    /* Return DAL COMP state */
    return hcomp->State;
}

/**
 * @brief  Return the COMP error code.
 * @param  hcomp COMP handle
 * @retval COMP error code
 */
uint32_t DAL_COMP_GetError(COMP_HandleTypeDef *hcomp)
{
    /* Check the COMP handle allocation */
    if (hcomp == NULL)
    {
        return 0UL;
    }

    /* Check the parameter */
    ASSERT_PARAM(IS_COMP_ALL_INSTANCE(hcomp->Instance));

    /* Return DAL COMP error code */
    return hcomp->ErrorCode;
}

/**
 * @}
 */

/**
 * @}
 */

#endif /* DAL_COMP_MODULE_ENABLED */

/**
  * @}
  */

/**
  * @}
  */

